"""
Дан список, содержащий искажённые данные с должностями и именами сотрудников.
Известно, что имя сотрудника всегда в конце строки.
Сформировать из этих имён и вывести на экран фразы вида: 'Привет, Игорь!'
"""
names_jobs = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАЙ',
              'директор аэлита']
for x in range(len(names_jobs)):
    names_jobs[x] = str(names_jobs[x])  # переводим объекты списка в строку
    names_jobs_list = names_jobs[x].split( ) # разделяем строку на объекты по пробелу и создаем список из строки
    hello = f'Привет, {names_jobs_list[-1].capitalize()}!'  # форматируем строку, первая буква последнего объекта
    # списка становится заглавной
    print(hello)  # выводим результат
