"""
Создать вручную список, содержащий цены на товары (10–20 товаров)
"""
prices_of_goods = [57.8, 46.51, 97, 12.3, 37.82, 76.9, 102.55, 66.6, 41.73, 50.3]

"""
Вывести на экран эти цены через запятую в одну строку, цена должна
отображаться в виде <r> руб <kk> коп
"""
prices_modified = []
for x in range(len(prices_of_goods)):
    prices = float(prices_of_goods[x])  # Переводим объекты списка в числа с плавающей точкой
    rub = int(prices * 100 // 100)  # находим значение рублей в целых числах
    kk = int(prices * 100 % 100)  # находим значение копеек в целых числах
    prices = f'{rub:02d} руб {kk:02d} коп'
    prices_modified.append(prices)  # создаем новый список с рублями и копейками
all_prices = str(prices_modified)[1:-1] # в одну строку без квадратных скобок
print(all_prices)
print('\n####################\n')  # для разделения подпунктов задачи

"""
Вывести цены, отсортированные по возрастанию, новый список не создавать
(доказать, что объект списка после сортировки остался тот же).
"""
print(id(prices_of_goods), prices_of_goods)  # выводим изначальный список
prices_of_goods.sort()  # отсортированный список
print(id(prices_of_goods), prices_of_goods)  # выводим отсортированный список
print('\n####################\n')

"""
Создать новый список, содержащий те же цены, но отсортированные по убыванию.
"""
prices_of_goods_rev = sorted(prices_of_goods, reverse = True)  # новый список, отсортированный по убыванию
print(id(prices_of_goods_rev), prices_of_goods_rev)
print('\n####################\n')

"""
Вывести цены пяти самых дорогих товаров.
"""
print(prices_of_goods[-5:])
